import { SectionTitle } from "../ui/SectionTitle";

export function About() {
  return (
    <section
      id="about"
      className="bg-surface-dark py-20 md:py-32 overflow-hidden"
    >
      <div className="mx-auto max-w-7xl px-6">
        <div className="mb-12">
          <SectionTitle color="text-white">
            Про мене
          </SectionTitle>
        </div>

        <div className="">
          <div className="max-w-3xl mx-auto space-y-4 text-sm md:text-base lg:text-lg leading-relaxed text-slate-300">
            <p>Вітаю, мене звати Олексій Меше.</p>
            <p>
              Мій професійний шлях - це еволюція від
              глибокої юридичної експертизи до стратегічного
              управління проєктами.
            </p>
            <p>
              Розпочавши діяльність у 2010 році, я
              зосередився на складних питаннях юридичного
              супроводу, антикризового управління бізнесом
              та податкового планування. Цей етап заклав
              фундамент мого розуміння внутрішніх механізмів
              стабільності компаній та навчив знаходити
              ефективні рішення навіть у найбільш критичних
              ситуаціях. В цей період та до 2015 року я
              здійснював незалежну професійну діяльність
              арбітражного керуючого (розпорядника майна,
              керуючого санацією та ліквідатора).
            </p>
            <p>
              З часом прагнення до масштабування результатів
              привело мене у сферу маркетингу, де з 2019
              року я почав поєднувати класичні маркетингові
              стратегії зі специфікою юридичної галузі.
              Робота на перетині права та маркетингу
              дозволила мені створювати унікальні підходи до
              просування професійних послуг, де довіра та
              репутація є ключовими активами.
            </p>
            <p>
              Починаючи з 2022 році фокус моєї уваги
              змістився у бік технологічного сектора.
              Сьогодні я застосовую накопичений досвід у
              юриспруденції, антикризовому менеджменті та
              маркетингу для надання комплексних послуг
              IT-компаніям. Моя робота включає повний цикл
              ведення IT-проєктів, де глибоке розуміння
              бізнес-процесів та правових аспектів допомагає
              забезпечувати стабільне зростання та успішну
              реалізацію інноваційних рішень у динамічному
              середовищі, зокрема це AELITA та LTS для
              юридичного ринку та «СУПіК: Система Управління
              Продуктами і Кухнею 2» («СУПіК2») у сфері
              дитячого харчування.
            </p>
            <p>
              Мій підхід до роботи базується на принципі
              повного супроводу клієнта, де головним
              пріоритетом є досягнення поставлених цілей
              через прозору та юридично захищену взаємодію.
              Я забезпечую надання комплексних послуг, що
              охоплюють широкий спектр завдань, залучаючи до
              виконання проєктів перевірених
              вузькопрофільних фахівців. Це дозволяє
              поєднувати глибоку експертизу в різних галузях
              із єдиним центром відповідальності, гарантуючи
              високу якість кожного етапу роботи.
            </p>
            <p>
              Фундаментом моєї взаємодії з партнерами є
              суворе дотримання договірних відносин, що
              забезпечує повну юридичну та фінансову
              прозорість для кожної сторони. Я виступаю
              гарантом якості та єдиною точкою контакту,
              координуючи роботу фахівців так, щоб клієнт
              міг зосередитися на стратегічних цілях, не
              відволікаючись на операційні нюанси. Таке
              поєднання індивідуальної відповідальності та
              колективного досвіду дозволяє ефективно
              вирішувати питання будь-якої складності в
              межах правового поля.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}
