import RevealCard from "../animation/RevealCard";
import Image from "next/image";
import { SectionTitle } from "../ui/SectionTitle";

const services = [
  {
    title: "СТВОРЕННЯ БІЗНЕСУ",
    description:
      "Забезпечення повного супроводу запуску вашої справи в Україні, пропонуючи професійну реєстрацію ТОВ або ФОП з підбором оптимальної системи оподаткування та актуальних КВЕДів із підготовкою статутних документів, відкриття банківських рахунків, отримання електронного підпису та реєстрацію платником ПДВ чи єдиного податку. Комплексний юридичний захист, консультації з бухгалтерського обліку та повна відповідність бізнесу чинному законодавству для швидкого й безпечного старту вашого проєкту.",
    delay: "delay-100",
  },
  {
    title: "ЮРИДИЧНИЙ МАРКЕТИНГ",
    description:
      "Забезпечення комплексного просування юридичних брендів, що включає розробку маркетингової стратегії, створення та оптимізацію професійних вебсайтів, налаштування контекстної реклами у Google Ads та таргетованої реклами у соціальних мережах, системне ведення експертних профілів у Facebook, Instagram та LinkedIn, управління репутацією та роботу з відгуками, SEO-просування для виведення практик у топ пошукової видачі, контент-маркетинг із написанням фахових статей і кейсів, а також впровадження CRM-систем для ефективної обробки лідів та аналітики продажів юридичних послуг.",
    delay: "delay-200",
  },
  {
    title: "ПОСЛУГИ ДЛЯ ІТ КОМПАНІЙ",
    description:
      "Забезпечення комплексного супроводу ІТ бізнесу, що охоплює повне бухгалтерське та податкове ведення компаній і ФОП, професійний юридичний захист інтересів у взаємодії з контрагентами та державними органами, а також експертне кадрове адміністрування, здійснення регулярного аудиту фінансової звітності, розробка договорів для міжнародної співпраці, забезпечення комплаєнс із вимогами Дія.City та надання оперативних консультацій з питань структурування бізнесу, мінімізації ризиків та оптимізації операційних процесів для сталого розвитку вашого технологічного бренду.",
    delay: "delay-300",
  },
  {
    title: "УПРАВЛІННЯ ІТ ПРОЄКТАМИ",
    description:
      "Забезпечення повного циклу управління ІТ проєктами від ініціації до успішного релізу, включаючи детальне планування архітектури та етапів розробки, формування та координацію розподілених команд, контроль якості на кожному етапі, управління ризиками та бюджетування, а також налагодження прозорих процесів комунікації між бізнесом і технічними фахівцями для досягнення стратегічних цілей у визначені терміни.",
    delay: "delay-400",
  },
  {
    title: "ОПОДАТКУВАННЯ",
    description:
      "Комплексний аналіз податкових ризиків, розробку ефективних моделей оподаткування для українського та міжнародного бізнесу, а також супровід перевірок і оскарження неправомірних рішень, забезпечення моніторингу змін у законодавстві та надання оперативних консультацій для захисту ваших фінансових інтересів.",
    delay: "delay-500",
  },
  {
    title: "КОМЕРЦІЙНА ДІЯЛЬНІСТЬ",
    description:
      "Комплексний супровід із питань комерційної діяльності та стратегічного планування, що включає професійне консультування щодо вибору оптимальної правової форми ведення бізнесу з урахуванням специфіки вашого ринку та масштабів проєкту. Забезпечення повної підтримки в процесі реєстрації фізичних осіб-підприємців та юридичних осіб різних організаційно-правових форм, допомагають розробити ефективні моделі корпоративного управління та налагодити внутрішні бізнес-процеси. Здійснення аналізу податкового навантаження для різних сценаріїв діяльності, підготовка необхідної документації та супроводження угод з купівлі-продажу активів або реструктуризації компаній. Окрім запуску нових проєктів, пропонуємо аудит існуючих комерційних структур для підвищення їхньої правової безпеки та операційної ефективності, забезпечуючи надійний фундамент для стабільного розвитку вашої справи в межах чинного законодавства.",
    delay: "delay-600",
  },
];

export function Services() {
  return (
    <section
      id="services"
      className="bg-secondary/30 py-20 md:py-20"
    >
      <div className="mx-auto max-w-7xl px-6">
        <div className="mb-12 text-center">
          <SectionTitle color="text-slate-900">
            Послуги
          </SectionTitle>
        </div>

        <div className="grid grid-cols-1 gap-8 md:grid-cols-2">
          {services.map((service, index) => (
            <RevealCard
              key={index}
              className="h-full"
              delayClass={service.delay}
            >
              <article
                key={service.title}
                className="w-full h-full group flex flex-col border border-border bg-white p-4 md:p-8 shadow-sm transition-all duration-500 hover:shadow-lg hover:border-yellow-dark/30 hover:shadow-neutral-10"
              >
                <div className="flex items-center gap-2">
                  <Image
                    src="./images/logo.svg"
                    alt="Логотип"
                    width={20}
                    height={20}
                    className="h-6 w-6 text-yellow-dark transition-transform duration-500 group-hover:scale-120"
                  />
                  <h3 className="font-serif text-sm md:text-lg tracking-wide text-card-foreground hyphens-auto">
                    {service.title}
                  </h3>
                </div>
                <p
                  className="mt-2 md:mt-4 grow text-[12px] md:text-[16px] leading-normal text-foreground/90 
              wrap-break-words overflow-wrap-anywhere"
                >
                  {service.description}
                </p>
              </article>
            </RevealCard>
          ))}
        </div>
      </div>
    </section>
  );
}
